config/betamocks/local_cache/mvi/find_profile/IdMWebService_796131730.yml

---
:method: :post
:body: <env:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Header/><env:Body><idm:PRPA_IN201306UV02
  xmlns="urn:hl7-org:v3" xmlns:idm="http://vaww.oed.oit.va.gov" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd"><id
  extension="WSDOC1709071906462200061921369" root="2.16.840.1.113883.4.349"/><creationTime
  value="20170907190647"/><versionCode code="3.0"/><interactionId extension="PRPA_IN201306UV02"
  root="2.16.840.1.113883.1.6"/><processingCode code="T"/><processingModeCode code="T"/><acceptAckCode
  code="NE"/><receiver typeCode="RCV"><device determinerCode="INSTANCE" classCode="DEV"><id
  extension="200VGOV" root="2.16.840.1.113883.4.349"/></device></receiver><sender
  typeCode="SND"><device determinerCode="INSTANCE" classCode="DEV"><id extension="200M"
  root="2.16.840.1.113883.4.349"/></device></sender><acknowledgement><typeCode code="AA"/><targetMessage><id
  extension="200VGOV-f0e397ab-d730-4950-a33b-6eabb6ba1770" root="1.2.840.114350.1.13.0.1.7.1.1"/></targetMessage><acknowledgementDetail><code
  codeSystemName="MVI" code="132" displayName="IMT"/><text>Identity Match Threshold</text></acknowledgementDetail><acknowledgementDetail><code
  codeSystemName="MVI" code="120" displayName="PDT"/><text>Potential Duplicate Threshold</text></acknowledgementDetail></acknowledgement><controlActProcess
  classCode="CACT" moodCode="EVN"><code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/><subject
  typeCode="SUBJ"><registrationEvent classCode="REG" moodCode="EVN"><id nullFlavor="NA"/><statusCode
  code="active"/><subject1 typeCode="SBJ"><patient classCode="PAT"><id extension="1008700582V780487^NI^200M^USVHA^P"
  root="2.16.840.1.113883.4.349"/><id extension="1005648030^NI^200DOD^USDOD^A" root="2.16.840.1.113883.3.42.10001.100001.12"/><id
  extension="0000028481^PN^200PROV^USDVA^A" root="2.16.840.1.113883.4.349"/><id extension="796131730^PI^200BRLS^USVBA^A"
  root="2.16.840.1.113883.4.349"/><statusCode code="active"/><patientPerson><name
  use="L"><given>BONNIE</given><family>HAYES</family></name><administrativeGenderCode
  code="F"/><birthTime value="19390705"/><addr use="PHYS"><country>USA</country></addr><asOtherIDs
  classCode="SSN"><id extension="796131730" root="2.16.840.1.113883.4.1"/><scopingOrganization
  determinerCode="INSTANCE" classCode="ORG"><id root="1.2.840.114350.1.13.99997.2.3412"/></scopingOrganization></asOtherIDs></patientPerson><subjectOf1><queryMatchObservation
  classCode="COND" moodCode="EVN"><code code="IHE_PDQ"/><value value="165" xsi:type="INT"/></queryMatchObservation></subjectOf1></patient></subject1><custodian
  typeCode="CST"><assignedEntity classCode="ASSIGNED"><id root="2.16.840.1.113883.4.349"/></assignedEntity></custodian></registrationEvent></subject><queryAck><queryId
  extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><queryResponseCode code="OK"/><resultCurrentQuantity
  value="1"/></queryAck><queryByParameter><queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><statusCode
  code="new"/><modifyCode code="MVI.COMP1"/><initialQuantity value="1"/><parameterList><livingSubjectAdministrativeGender><value
  code="F"/><semanticsText>Gender</semanticsText></livingSubjectAdministrativeGender><livingSubjectBirthTime><value
  value="19390705"/><semanticsText>Date of Birth</semanticsText></livingSubjectBirthTime><livingSubjectId><value
  extension="796131730" root="2.16.840.1.113883.4.1"/><semanticsText>SSN</semanticsText></livingSubjectId><livingSubjectName><value
  use="L"><given>BONNIE</given><family>HAYES</family></value><semanticsText>Legal
  Name</semanticsText></livingSubjectName></parameterList></queryByParameter></controlActProcess></idm:PRPA_IN201306UV02></env:Body></env:Envelope>
:headers:
  connection: close
  date: Fri, 08 Sep 2017 00:06:39 GMT
  content-length: '3957'
  content-type: text/xml
  set-cookie: JSESSIONID=CtmdZxfWqtgn1G2L3hCp8ycpYhdhX7R7pGsHhWxGTYJyFT5LLGJG!544686593;
    path=/; HttpOnly
  x-powered-by: Servlet/2.5 JSP/2.1
:status: 200
